
#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 04: Arrays, Zeiger, Referenzen
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Arrays
- Speicherbereich /fester/ Größe
- enthält hintereinander Elemente /eines/ Typs
- keine Längeninformation zur Laufzeit vorhanden!
- Name des Arrays als Zeiger auf erstes Element!

#+header: :exports both :results output :tangle src/array.cpp
#+BEGIN_SRC C++
#include <iostream>  // array.cpp
using namespace std;
int main() {
    int odd[4];
    cout << sizeof(odd) / sizeof(int) << endl;
}
#+END_SRC

#+RESULTS:
: 4

* C-String
#+header: :exports both :results output :tangle src/cstring.cpp
#+BEGIN_SRC C++
#include <iostream>  // cstring.cpp
using namespace std;
int main() {
    const char cstr[4]{"abc"};
    // also possible: const char cstr[]{"abc"};
    cout << cstr[0] << ' '
         << static_cast<int>(cstr[3]) << endl;
}
#+END_SRC

#+RESULTS:
: a 0

* C-String -- 2
#+header: :exports both :results output :tangle src/cstring2.cpp
#+BEGIN_SRC C++
#include <iostream>  // cstring2.cpp
using namespace std;
int main() {
    char cstr[10]{'a', 'b', 'c'};
    cstr[5] = 'e';
    cout << cstr[0] << ' '
         << static_cast<int>(cstr[3]) << ' '
         << static_cast<int>(cstr[4]) << ' '
         << cstr[5] << ' '
         << static_cast<int>(cstr[6]) << endl;
}
#+END_SRC

#+RESULTS:
: a 0 0 e 0

C-String-Funktionen: String endet mit erstem ='\0'=!

* Zeiger -- 5
\vspace{1.5em}
#+header: :exports code :results output :tangle src/pointer5.cpp :flags -std=c++1y -Ofast
#+BEGIN_SRC C++
#include <iostream>  // pointer5.cpp
#include <string>
using namespace std;

struct Person {
    string first_name;  string last_name;
    int year_of_birth;
};

int main() {
    Person* p{new Person{"Max", "Mustermann", 90}};
    cout << (*p).first_name << endl; //parentheses!
    cout << p->last_name << endl;
    delete p;
    p = nullptr;  delete p;  // safe!
}
#+END_SRC

#+RESULTS:
: Max
: Mustermann

